# See https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

tap "caskroom/cask"
brew "imagemagick"

cask "google-chrome"

tap "beeftornado/rmtree"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"

# Tap some casks
tap "caskroom/cask"
tap "caskroom/fonts"

cask "xquartz"
brew "autoconf"
brew "automake"
brew "boost"
brew "gettext"
brew "coreutils"
brew "zeromq"
brew "czmq"
brew "dcraw"
brew "elasticsearch"
brew "lame"
brew "x264"
brew "xvid"
brew "ffmpeg"

brew "icu4c"
brew "libtool"
brew "fontforge"
brew "libgpg-error"
brew "libksba"
brew "gnupg"
brew "go"
brew "lua"
brew "highlight"
brew "htop"
brew "httrack"
brew "hub"
brew "imagemagick"
brew "mozjpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "libevent"
brew "libsndfile"
brew "libsodium"
brew "libvo-aacenc"
brew "libxml2"
brew "libyaml"
brew "memcached"
brew "mongodb"
brew "mplayer"
brew "mysql"
brew "nginx"
brew "node"
brew "pngcrush"
brew "pngquant"
brew "sqlite"
brew "postgresql", restart_service: true
brew "potrace"
brew "redis"
brew "rust"
brew "siege"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tree"
brew "unixodbc"
brew "unrar"
brew "watchman"
brew "wget"
brew "homebrew/php/php-code-sniffer"
brew "homebrew/php/php-code-sniffer@2.9"
brew "homebrew/php/phplint"
brew "homebrew/php/phpunit"
cask "betterzipql"
cask "mactex"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "robomongo"
cask "skim"
cask "webpquicklook"
cask "lunchy"

# Key Visualization for webcasting
# https://github.com/keycastr/keycastr
cask "keycastr"

# Install Cask
install caskroom/cask/brew-cask

# Install Casks
cask install alfred
cask install caffeine
cask install flux

cask install virtualbox
cask install vagrant

cask install google-chrome
cask install iterm2
cask install sequel-pro
cask install macvim

cask install nvalt
cask install slack
cask install vlc
cask install the-unarchiver


## FONTS
# See https://github.com/caskroom/homebrew-fonts
# We might have to change the appdir here
cask "font-fira-code"
cask "font-fira-mono"
cask "font-input"
cask "font-monoid"
cask "font-monoisome"
cask "font-mononoki"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"